[errorMsg]

PCT_ERR_FAIL="Unknown error"

PCT_ERR_INVALUD_PARS="Invalid parameter"

PCT_ERR_NOT_SURPPORT="Not supported"

PCT_ERR_OPEN_FILE_FAIL="Failed to open the file"

PCT_ERR_NO_MEMORY="Insufficient memory"

PCT_ERR_READ_FILE="Failed to read the file."

PCT_ERR_FILE_FORMAT="File format error"

PCT_ERR_NOMORE_ITEM="There are no more files"

PCT_ERR_FILE_PROCESS="Failed to process the file"

PCT_ERR_MEMORY_FAIL="Memory error"

PCT_ERR_WRITE_FILE="Failed to write the file"

PCT_ERR_USER_CANCEL="User cancelled"

PCT_ERR_NOT_INIT_FUN="Uninitialized"

PCT_ERR_CREATE_THREAD="Failed to create thread"

PCT_ERR_DEVICE_NO_MORE_SPACE="Insufficient disk space"

PCT_ERR_DEVICE_FAIL="Device error"

PCT_ERR_PATH_INVALID="Invalid path"

PCT_ERR_CALL_API="Failed to call"

PCT_ERR_FILE_NOT_EXIST="The file does not exist"

PCT_ERR_FILE_IN_USING="The file is being used by another process."

PCT_ERR_REG_FAIL="Registry error"

PCT_ERR_NET_CONN="Network is not connected or is disconnected"

PCT_ERR_LICENSE_OUTDATA="License has expired"

PCT_ERR_NOT_SAME_VERSION="Versions are inconsistent."

PCT_ERR_NO_DISKSPACE="Insufficient disk space."

PCT_ERR_NTFS_MUST="Failed to transfer the applications because they are not installed on NTFS file system."

PCT_ERR_INSTALL_APPX_FAILED="These applications are incompatible with the target PC. Re-installation is required."

PCT_ERR_MOVE_APPX_FAILED="The application is incompatible with file system of the target partition."


